<template>
    <div>
        <div class="group">
            <span>校验数字</span>
            <div>
                1. 数字：^[0-9]*$<br>
                2. n位的数字：^\d{n}$<br>
                3. 至少n位的数字：^\d{n,}$<br>
                4. m-n位的数字：^\d{m,n}$a<br>
                5. 零和非零开头的数字：^(0|[1-9][0-9]*)$<br>
                6. 非零开头的最多带两位小数的数字：^([1-9][0-9]*)+(.[0-9]{1,2})?$<br>
                7. 带1-2位小数的正数或负数：^(\-)?\d+(\.\d{1,2})?$<br>
                8. 正数、负数、和小数：^(\-|\+)?\d+(\.\d+)?$<br>
                9. 有两位小数的正实数：^[0-9]+(.[0-9]{2})?$<br>
                10. 有1~3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$<br>
                11. 非零的正整数：^[1-9]\d*$ 或 ^([1-9][0-9]*){1,3}$ 或 ^\+?[1-9][0-9]*$<br>
                12. 非零的负整数：^\-[1-9][0-9]"*$ 或 ^-[1-9]\d*$<br>
                13. 非负整数：^\d+$ 或 ^[1-9]\d*|0$<br>
                14. 非正整数：^-[1-9]\d*|0$ 或 ^((-\d+)|(0+))$<br>
                15. 非负浮点数：^\d+(\.\d+)?$ 或 ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$<br>
                16. 非正浮点数：^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 或 ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$<br>
                17. 正浮点数：^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$ 或 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$<br>
                18. 负浮点数：^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$ 或 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$<br>
                19. 浮点数：^(-?\d+)(\.\d+)?$ 或 ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$
            </div>
        </div>
        <div class="group">
            <span>校验字符</span>
            <div>
                1. 汉字：^[\u4e00-\u9fa5]{0,}$<br>
                2. 英文和数字：^[A-Za-z0-9]+$ 或 ^[A-Za-z0-9]{4,40}$<br>
                3. 长度为3-20的所有字符：^.{3,20}$<br>
                4. 由26个英文字母组成的字符串：^[A-Za-z]+$<br>
                5. 由26个大写英文字母组成的字符串：^[A-Z]+$<br>
                6. 由26个小写英文字母组成的字符串：^[a-z]+$<br>
                7. 由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$<br>
                8. 由数字、26个英文字母或者下划线组成的字符串：^\w+$ 或 ^\w{3,20}$<br>
                9. 中文、英文、数字包括下划线：^[\u4E00-\u9FA5A-Za-z0-9_]+$<br>
                10. 中文、英文、数字但不包括下划线等符号：^[\u4E00-\u9FA5A-Za-z0-9]+$ 或 ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$<br>
                11. 可以输入含有^%&',;=?$\"等字符：[^%&',;=?$\x22]+ 12 禁止输入含有~的字符：[^~\x22]+
            </div>
        </div>
        <div class="group">
            <span>其他</span>
            <div>
                1. Email地址：^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$<br>
                2. 域名：[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?<br>
                3. InternetURL：[a-zA-z]+://[^\s]* 或 ^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$<br>
                4. 手机号码：^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$<br>
                5. 身份证号：^[1-9]\d{5}(18|19|20|(3\d))\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$
            </div>
        </div>
         <el-button type="primary" @click="close" plain class="pull-right">关闭</el-button>
    </div>
</template>

<script>
export default {
    name: 'Example',

    data() {
        return {
            
        };
    },

    mounted() {
        
    },

    methods: {
        close(){
            this.$emit("close")
        }
    },
};
</script>

<style lang="scss" scoped>
.group{
    display: flex; 
    justify-content: flex-start;
    margin-bottom: 20px;
    span{ 
        display:inline-block; 
        width: 80px; 
        text-align: right;
        margin-right: 10px;
        
    }
    div{
        width: 85%;
        height: 200px;
        border: solid 1px #eee;
        overflow: auto;
        padding: 10px 20px;
        line-height: 30px;
        &:hover{
            border: solid 1px #409EFF;
        }
    }
    }
</style>